results/baseline/ramp/run-02/k6-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/gabrielmoc/Downloads/TCC - Gabriel/tests/load/recommendations-ramp.js
        output: -

     scenarios: (100.00%) 1 scenario, 15 max VUs, 50s max duration (incl. graceful stop):
              * ramp_load: Up to 15 looping VUs for 45s over 3 stages (gracefulRampDown: 5s, gracefulStop: 30s)


running (01.0s), 01/15 VUs, 1 complete and 0 interrupted iterations
ramp_load   [   2% ] 01/15 VUs  01.0s/45.0s

running (02.0s), 02/15 VUs, 4 complete and 0 interrupted iterations
ramp_load   [   4% ] 02/15 VUs  02.0s/45.0s

running (03.0s), 03/15 VUs, 9 complete and 0 interrupted iterations
ramp_load   [   7% ] 03/15 VUs  03.0s/45.0s

running (04.0s), 04/15 VUs, 16 complete and 0 interrupted iterations
ramp_load   [   9% ] 04/15 VUs  04.0s/45.0s

running (05.0s), 05/15 VUs, 25 complete and 0 interrupted iterations
ramp_load   [  11% ] 05/15 VUs  05.0s/45.0s

running (06.0s), 06/15 VUs, 36 complete and 0 interrupted iterations
ramp_load   [  13% ] 06/15 VUs  06.0s/45.0s

running (07.0s), 07/15 VUs, 49 complete and 0 interrupted iterations
ramp_load   [  16% ] 07/15 VUs  07.0s/45.0s

running (08.0s), 08/15 VUs, 63 complete and 0 interrupted iterations
ramp_load   [  18% ] 08/15 VUs  08.0s/45.0s

running (09.0s), 09/15 VUs, 79 complete and 0 interrupted iterations
ramp_load   [  20% ] 09/15 VUs  09.0s/45.0s

running (10.0s), 10/15 VUs, 97 complete and 0 interrupted iterations
ramp_load   [  22% ] 10/15 VUs  10.0s/45.0s

running (11.0s), 11/15 VUs, 117 complete and 0 interrupted iterations
ramp_load   [  24% ] 11/15 VUs  11.0s/45.0s

running (12.0s), 12/15 VUs, 139 complete and 0 interrupted iterations
ramp_load   [  27% ] 12/15 VUs  12.0s/45.0s

running (13.0s), 13/15 VUs, 162 complete and 0 interrupted iterations
ramp_load   [  29% ] 13/15 VUs  13.0s/45.0s

running (14.0s), 14/15 VUs, 188 complete and 0 interrupted iterations
ramp_load   [  31% ] 14/15 VUs  14.0s/45.0s

running (15.0s), 14/15 VUs, 216 complete and 0 interrupted iterations
ramp_load   [  33% ] 14/15 VUs  15.0s/45.0s

running (16.0s), 15/15 VUs, 245 complete and 0 interrupted iterations
ramp_load   [  36% ] 15/15 VUs  16.0s/45.0s

running (17.0s), 15/15 VUs, 275 complete and 0 interrupted iterations
ramp_load   [  38% ] 15/15 VUs  17.0s/45.0s

running (18.0s), 15/15 VUs, 305 complete and 0 interrupted iterations
ramp_load   [  40% ] 15/15 VUs  18.0s/45.0s

running (19.0s), 15/15 VUs, 334 complete and 0 interrupted iterations
ramp_load   [  42% ] 15/15 VUs  19.0s/45.0s

running (20.0s), 15/15 VUs, 364 complete and 0 interrupted iterations
ramp_load   [  44% ] 15/15 VUs  20.0s/45.0s

running (21.0s), 15/15 VUs, 392 complete and 0 interrupted iterations
ramp_load   [  47% ] 15/15 VUs  21.0s/45.0s

running (22.0s), 15/15 VUs, 422 complete and 0 interrupted iterations
ramp_load   [  49% ] 15/15 VUs  22.0s/45.0s

running (23.0s), 15/15 VUs, 452 complete and 0 interrupted iterations
ramp_load   [  51% ] 15/15 VUs  23.0s/45.0s

running (24.0s), 15/15 VUs, 482 complete and 0 interrupted iterations
ramp_load   [  53% ] 15/15 VUs  24.0s/45.0s

running (25.0s), 15/15 VUs, 512 complete and 0 interrupted iterations
ramp_load   [  56% ] 15/15 VUs  25.0s/45.0s

running (26.0s), 15/15 VUs, 542 complete and 0 interrupted iterations
ramp_load   [  58% ] 15/15 VUs  26.0s/45.0s

running (27.0s), 15/15 VUs, 572 complete and 0 interrupted iterations
ramp_load   [  60% ] 15/15 VUs  27.0s/45.0s

running (28.0s), 15/15 VUs, 602 complete and 0 interrupted iterations
ramp_load   [  62% ] 15/15 VUs  28.0s/45.0s

running (29.0s), 15/15 VUs, 630 complete and 0 interrupted iterations
ramp_load   [  64% ] 15/15 VUs  29.0s/45.0s

running (30.0s), 15/15 VUs, 659 complete and 0 interrupted iterations
ramp_load   [  67% ] 15/15 VUs  30.0s/45.0s

running (31.0s), 15/15 VUs, 689 complete and 0 interrupted iterations
ramp_load   [  69% ] 15/15 VUs  31.0s/45.0s

running (32.0s), 15/15 VUs, 719 complete and 0 interrupted iterations
ramp_load   [  71% ] 15/15 VUs  32.0s/45.0s

running (33.0s), 15/15 VUs, 749 complete and 0 interrupted iterations
ramp_load   [  73% ] 15/15 VUs  33.0s/45.0s

running (34.0s), 15/15 VUs, 779 complete and 0 interrupted iterations
ramp_load   [  76% ] 15/15 VUs  34.0s/45.0s

running (35.0s), 15/15 VUs, 809 complete and 0 interrupted iterations
ramp_load   [  78% ] 15/15 VUs  35.0s/45.0s

running (36.0s), 14/15 VUs, 839 complete and 0 interrupted iterations
ramp_load   [  80% ] 14/15 VUs  36.0s/45.0s

running (37.0s), 13/15 VUs, 867 complete and 0 interrupted iterations
ramp_load   [  82% ] 13/15 VUs  37.0s/45.0s

running (38.0s), 12/15 VUs, 888 complete and 0 interrupted iterations
ramp_load   [  84% ] 12/15 VUs  38.0s/45.0s

running (39.0s), 10/15 VUs, 911 complete and 0 interrupted iterations
ramp_load   [  87% ] 10/15 VUs  39.0s/45.0s

running (40.0s), 08/15 VUs, 930 complete and 0 interrupted iterations
ramp_load   [  89% ] 08/15 VUs  40.0s/45.0s

running (41.0s), 07/15 VUs, 945 complete and 0 interrupted iterations
ramp_load   [  91% ] 07/15 VUs  41.0s/45.0s

running (42.0s), 05/15 VUs, 958 complete and 0 interrupted iterations
ramp_load   [  93% ] 05/15 VUs  42.0s/45.0s

running (43.0s), 04/15 VUs, 968 complete and 0 interrupted iterations
ramp_load   [  96% ] 04/15 VUs  43.0s/45.0s

running (44.0s), 03/15 VUs, 975 complete and 0 interrupted iterations
ramp_load   [  98% ] 03/15 VUs  44.0s/45.0s

running (45.0s), 01/15 VUs, 980 complete and 0 interrupted iterations
ramp_load   [ 100% ] 01/15 VUs  45.0s/45.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<1500' p(95)=7.42ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 2943    65.271482/s
    checks_succeeded...: 100.00% 2943 out of 2943
    checks_failed......: 0.00%   0 out of 2943

    ✓ status 200
    ✓ response has userId
    ✓ response has recommendations

    HTTP
    http_req_duration..............: avg=4.63ms   min=1.61ms   med=4.36ms   max=52.12ms  p(90)=6.63ms   p(95)=7.42ms  
      { expected_response:true }...: avg=4.63ms   min=1.61ms   med=4.36ms   max=52.12ms  p(90)=6.63ms   p(95)=7.42ms  
    http_req_failed................: 0.00%  0 out of 981
    http_reqs......................: 981    21.757161/s

    EXECUTION
    iteration_duration.............: avg=505.67ms min=501.87ms med=505.47ms max=553.26ms p(90)=507.73ms p(95)=508.45ms
    iterations.....................: 981    21.757161/s
    vus............................: 1      min=1        max=15
    vus_max........................: 15     min=15       max=15

    NETWORK
    data_received..................: 539 kB 12 kB/s
    data_sent......................: 89 kB  2.0 kB/s



running (45.1s), 00/15 VUs, 981 complete and 0 interrupted iterations
ramp_load ✓ [ 100% ] 00/15 VUs  45s